Revit 2024 API
ISaveSharedCoordinatesCallback Interface
 An interface that may be used to control Revit when trying to unload or reload a Revit link with changes in shared coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface ISaveSharedCoordinatesCallback
Visual Basic
Public Interface ISaveSharedCoordinatesCallback
Visual C++
public interface class ISaveSharedCoordinatesCallback
See Also
ISaveSharedCoordinatesCallback Members
Autodesk.Revit.DB Namespace